@echo off
echo 스팀 북유럽(러시아+스웨덴 스톡홀름) 서버 차단 프로그램:

echo 북유럽(러시아+스웨덴 스톡홀름) 차단 중...
netsh advfirewall firewall add rule name=blockRussia dir=out action=block profile=any protocol=any remoteip=146.66.154.0-146.66.154.255,146.66.156.0-146.66.156.255,146.66.157.0-146.66.157.255,155.133.242.0-155.133.242.255,155.133.252.0-155.133.252.255,162.254.192.0-162.254.199.255,162.254.198.0-162.254.198.255,185.25.180.0-185.25.180.255,185.25.181.0-185.25.181.255,185.25.182.0-185.25.182.255

echo 작업을 완료했습니다.

pause
exit